/*!
 * @file operation-kind-data-set.class.h++
 */

#ifndef TEST__INCLUDE__SQLXX__EXPRESSION__DATA_SET__OPERATION_KIND_DATA_SET_HXX
#define TEST__INCLUDE__SQLXX__EXPRESSION__DATA_SET__OPERATION_KIND_DATA_SET_HXX

#include <vector>

#include <sql++/expression/operation/operation-kind.enum-class.h++>

#include "./operation-kind-data-set-element.class.h++"

namespace sqlxx::test
{
inline namespace expression
{
    ////////////////////////////////////////////////////////////////////////////
    //
    // Class definition
    //
    ////////////////////////////////////////////////////////////////////////////

    /*!
     * @brief ≪演算種別≫のテストケースで使用するデータセットを生成するクラス
     *
     * @see sqlxx::expression::OperationKind              テスト対象オブジェクトの型
     * @see sqlxx::test::expression::OperationKindDataSet データセット要素
     */
    class OperationKindDataSet
    {
    public:
        /*! @brief ≪演算種別≫のテストケースで使用するデータセットを生成する */
        static auto for_some_test_case()
            -> std::vector<OperationKindDataSetElement>;
    };

    ////////////////////////////////////////////////////////////////////////////
    //
    // Class member definition
    //
    ////////////////////////////////////////////////////////////////////////////

    /*!
     * [ データパターン表 ] @n
     * <pre>
     * -----------------------
     * |     | OperationKind |
     * |=====|===============|
     * |  _0 | None          |
     * |-----|---------------|
     * |  _1 | EqualTo       |
     * |-----|---------------|
     * |  _2 | NotEqualTo    |
     * |-----|---------------|
     * |  _3 | Less          |
     * |-----|---------------|
     * |  _4 | LessEqual     |
     * |-----|---------------|
     * |  _5 | Greater       |
     * |-----|---------------|
     * |  _6 | GreaterEqual  |
     * |-----|---------------|
     * |  _7 | LogicalNot    |
     * |-----|---------------|
     * |  _8 | LogicalAnd    |
     * |-----|---------------|
     * |  _9 | LogicalOr     |
     * |-----|---------------|
     * | _10 | Is            |
     * -----------------------
     * </pre>
     *
     * [ 凡例 ] @n
     * @li OperationKind ... テスト対象関数の引数となるオブジェクト
     *
     * @return ≪演算種別≫のテストケースで使用するデータセット
     *
     * @see sqlxx::expression::to_string() テスト対象関数
     */
    auto OperationKindDataSet::for_some_test_case()
        -> std::vector<OperationKindDataSetElement>
    {
        // clang-format off
        return {
            // _0
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪演算未定≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::None,

                // 期待結果 - to_string 関数
                "",
            },

            // _1
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪等値比較演算≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::EqualTo,

                // 期待結果 - to_string 関数
                "=",
            },

            // _2
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪非等値比較演算≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::NotEqualTo,

                // 期待結果 - to_string 関数
                "<>",
            },

            // _3
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪比較演算（小なり）≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::Less,

                // 期待結果 - to_string 関数
                "<",
            },

            // _4
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪比較演算（以下）≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::LessEqual,

                // 期待結果 - to_string 関数
                "<=",
            },

            // _5
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪比較演算（大なり）≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::Greater,

                // 期待結果 - to_string 関数
                ">",
            },

            // _6
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪比較演算（以上）≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::GreaterEqual,

                // 期待結果 - to_string 関数
                ">=",
            },

            // _7
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪論理否定演算≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::LogicalNot,

                // 期待結果 - to_string 関数
                "NOT",
            },

            // _8
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪論理積演算≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::LogicalAnd,

                // 期待結果 - to_string 関数
                "AND",
            },

            // _9
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪論理和演算≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::LogicalOr,

                // 期待結果 - to_string 関数
                "OR",
            },

            // _10
            ////////////////////////////////////////////////////////////////////
            // [ データパターン ]
            // + OperationKind : ≪IS演算≫
            ////////////////////////////////////////////////////////////////////
            {
                // テスト対象オブジェクト
                OperationKind::Is,

                // 期待結果 - to_string 関数
                "IS",
            },
        };
        // clang-format on
    }
} // namespace expression
} // namespace sqlxx::test

#endif /* TEST__INCLUDE__SQLXX__EXPRESSION__DATA_SET__OPERATION_KIND_DATA_SET_HXX */
